[M_Nast_Vday_Side01 MissionDefinition]
MissionName="Learning to Love"

[M_Nast_Vday_Side01:CollectABlondeWigSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns. He's asked you to find some romantic gifts for him while he records some sweet nothings into an ECHO recorder.<br><br>You've already collected a cigar for him. Next, you'll need a blonde wig. Why? Let's hope you never find out."

[M_Nast_Vday_Side01:CollectCanOfGreaseSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns.  He's asked you to find some romantic gifts for him while he records some sweet nothings into an ECHO recorder.<br><br>You've already collected a cigar and a blonde wig for him. Next, he's asked for a can of grease."

[M_Nast_Vday_Side01:DeliverBlondeWigGiftSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns.<br><br>You collected a bunch of random ''romantic'' gifts for him, which he now wants you to deliver to some of his potential soulmates. First: deliver the blonde wig."

[M_Nast_Vday_Side01:DeliverCanOfGreaseGiftSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns.<br><br>You collected a bunch of random ''romantic'' gifts for him, which he now wants you to deliver to some of his potential soulmates. Next: deliver the can of grease to Moxxi."

[M_Nast_Vday_Side01:DeliverCigarGiftSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns.<br><br>You collected a bunch of random ''romantic'' gifts for him, which he now wants you to deliver to some of his potential soulmates. Next: deliver the cigar."

[M_Nast_Vday_Side01:KillInnuendobotSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns.<br><br>You collected and delivered a bunch of random ''romantic'' gifts for him.<br><br>Unfortunately, the last gift went to his creator, Moxxi. Upon receiving said gift, Moxxi expressed her irritation with Innuendobot and asked you to kill him."

[M_Nast_Vday_Side01:ReturnToInnuendobotSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns.<br><br>You collected a bunch of random ''romantic'' gifts for him. Now you just need to head back and figure out what the heck he wants to do with all of them."

[M_Nast_Vday_Side01:ReturnToMoxxiSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Innuendobot 5000 was interested in romance, but his definition of ''love'' was a little too stalker-y for Moxxi's tastes. With Innuendobot deactivated, you can return to Moxxi and get your reward."

[M_Nast_Vday_Side01:SpareInnuendobotSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns.<br><br>You collected and delivered a bunch of random ''romantic'' gifts for him.<br><br>Unfortunately, the last gift went to his creator, Moxxi. Upon receiving said gift, Moxxi expressed her irritation with Innuendobot and asked you to kill him. But then Innuendobot said something nice, so Moxxi asked you to spare him."

[M_Nast_Vday_Side01:WasteHimSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="For some reason, Innuendobot 5000 is more interested in romance than sexy puns.<br><br>You collected and delivered a bunch of random ''romantic'' gifts for him.<br><br>Unfortunately, the last gift went to his creator, Moxxi. Upon receiving said gift, Moxxi expressed her irritation with Innuendobot and asked you to kill him. But then Innuendobot said something nice, so Moxxi asked you to spare him. Then he foolishly revealed his fake sincerity, so Moxxi asked you to go back to the first plan and kill him."
